# Исходные данные
numbers = [4, 7, 2, 9, 12, 5, 8, 3]

# Задание 21: Реализация аналогичного решения генераторным выражением
# Читается справа налево: берем числа, фильтруем (if), возводим в квадрат и суммируем
result_gen = sum(number ** 2 for number in numbers if number % 2 == 0)

print("Сумма (через генераторное выражение):", result_gen)


# Задание 22: Получение отдельного списка квадратов чётных чисел
# Используем списковое включение (List Comprehension) для создания нового списка
even_squares_list = [number ** 2 for number in numbers if number % 2 == 0]

print("Список квадратов чётных чисел:", even_squares_list)

#в фп нет изменяемых переменных(главный вывод)